Week_6/Day_1/video-games-tournament/app/controllers/tournaments_controller.rb

  def api
    tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def create
    newTournament = Tournament.create name: params[:tournament][:name]
---
INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "surf"], ["created_at", "2016-07-18 15:58:03.300970"], ["updated_at", "2016-07-18 15:58:03.300970"]]

  def delete
    tournament = Tournament.find_by(id: params[:id])
    tournament.destroy
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 1]]